snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/ИсторияГТИННоменклатуры/ИсторияГТИННоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияГТИННоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ГТИН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидГТИН</name>
    <type>
      <types>EnumRef.ВидыГТИН</types>
    </type>
  </attributes>
  <attributes>
    <name>СнятСПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/WebServices/wsWWW/Module.bsl
//16122025 ТЮА

Функция ЗначениеИзХранилища(ХранилищеЗначений)
		
	Возврат  ХранилищеЗначений.Получить();
	
КонецФункции

Функция ЗначениеВХранилище(Значение)
	
	Хранилище = Новый ХранилищеЗначения(Значение, Новый СжатиеДанных(9));
	 	
	Возврат Хранилище;
    	
КонецФункции

Функция ИнформацияОФото(Штрихкод)  
	
	массивШК = ЗначениеИзХранилища(Штрихкод);

    тШтрихкод = массивШК[0];
	
	МассивСтр = Новый Массив;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &Штрихкод"; 
	
	Запрос.Параметры.Вставить("Штрихкод", тШтрихкод); 	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НоваяСтр = Новый Соответствие;    
		
		ТекТовар =  ВыборкаДетальныеЗаписи.Владелец;
		РодТовара = ТекТовар.Родитель;  	
		
		НоваяСтр.Вставить("Код",ТекТовар.Код);
		НоваяСтр.Вставить("Наименование",ТекТовар.Наименование); 				
		
		МассивСтр.Добавить(НоваяСтр);   	//инфо о товаре	
		
		ЗапросВ = Новый Запрос;
		ЗапросВ.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Код КАК Код
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Родитель = &Родитель
		|	И Номенклатура.Ссылка <> &Ссылка";  
		
		ЗапросВ.Параметры.Вставить("Родитель", РодТовара); 		
		ЗапросВ.Параметры.Вставить("Ссылка", ТекТовар.Ссылка); 
		
		РезультатВ = ЗапросВ.Выполнить().Выгрузить();
		
		МассивСтр.Добавить(РезультатВ);     //похожий товар
		
	Иначе	
		Возврат ЗначениеВХранилище(Ложь);
	КонецЕсли;          
	
	ЗапросО = Новый Запрос;
	ЗапросО.Текст =	
	
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК Остаток,
	|	ОстаткиТМЦОстатки.Склад.Наименование КАК МестоХранения
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТМЦОстатки.КоличествоОстаток УБЫВ";
	ЗапросО.Параметры.Вставить("Номенклатура", ТекТовар); 
	
    Результат0 = ЗапросО.Выполнить().Выгрузить();
		
	МассивСтр.Добавить(Результат0); //отстатки	

	
	КаталогКартинок			=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить())+"Pictures\";   
	ПустаяКартинка = Новый Картинка;


	ТекДанные = Справочники.Номенклатура.НайтиПоКоду(ТекТовар.Код);
	
	Если ТекДанные<>Справочники.Номенклатура.ПустаяСсылка() Тогда    	
		
		ИмяФайлаКартинки=КаталогКартинок+?(ТекДанные.ЭтоГруппа,ТекДанные.Код,ТекДанные.Родитель.Код)+".jpg";
			                                                         	
		Файл=Новый Файл(ИмяФайлаКартинки);
		Если Файл.Существует() Тогда
			ВыбранноеФото = Новый Картинка(ИмяФайлаКартинки);			
		Иначе
			ВыбранноеФото = Новый Картинка(); 
		КонецЕсли;  
		
		МассивСтр.Добавить(ВыбранноеФото); 
		
	КонецЕсли;
	
	Возврат ЗначениеВХранилище(МассивСтр);  
	
КонецФункции

Функция ИнформацияОНоменклатура(Штрихкод) 
	//"8300041958028"
	МойМассив = ЗначениеИзХранилища(Штрихкод);

    тШтрихкод = МойМассив[0];
	
	МассивСтр = Новый Массив;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &Штрихкод"; 
	
	Запрос.Параметры.Вставить("Штрихкод", тШтрихкод); 	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НоваяСтр = Новый Соответствие;    
		
		ТекТовар =  ВыборкаДетальныеЗаписи.Владелец;
		РодТовара = ТекТовар.Родитель;  	
		
		НоваяСтр.Вставить("Код",           ТекТовар.Код);
		НоваяСтр.Вставить("Наименование",  ТекТовар.Наименование); 				
		НоваяСтр.Вставить("КодР",          РодТовара.Код);
		НоваяСтр.Вставить("НаименованиеР", РодТовара.Наименование);		
		НоваяСтр.Вставить("ШтукВКоробке",  РодТовара.ШтукВКоробке);
		НоваяСтр.Вставить("ШтукВКоробочке",РодТовара.ШтукВКоробочке);  
		
		МассивСтр.Добавить(НоваяСтр);   //информация о товаре		
		
		ЗапросВ = Новый Запрос;
		ЗапросВ.Текст = 
		"ВЫБРАТЬ
		|	ШтрихКоды.Наименование КАК Наименование,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ВидШК) КАК ВидШК,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ТипШК) КАК ТипШК,
		|	ШтрихКоды.Код КАК КодШК
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Владелец = &Владелец";
		ЗапросВ.Параметры.Вставить("Владелец", ТекТовар); 		
		ЗапросВ.Параметры.Вставить("ВидШК",    Перечисления.ВидыШК.Основной); 
		
		РезультатВ = ЗапросВ.Выполнить().Выгрузить();
		
		МассивСтр.Добавить(РезультатВ); //информация о штрихкоде

	Иначе
		
		//штрихкод не найден в базе
		Возврат ЗначениеВХранилище(Ложь);
		
	КонецЕсли;
	
	Возврат ЗначениеВХранилище(МассивСтр); 	
	
КонецФункции        


Функция РазбираемАгрегацию(Штрихкод)  Экспорт
		
	МойМассив = ЗначениеИзХранилища(Штрихкод);

    тШтрихкод = МойМассив[0]; 
			
	МассивСтр = Новый Массив;  
		
	СтруктураМарки  =Неопределено;
	ДанныеМаркиЧЗ   =НайтиТоварПоШтрихКоду(тШтрихкод,Неопределено,0,СтруктураМарки,Ложь);
	
	//из марки получить штрихкод единицы товара , а нам нужна КОРОБКИ штрихкод
			
	Если СтруктураМарки<>Неопределено Тогда 
		
		ШтрихКодШтуки	    = СтруктураМарки.ШтрихКод;  
		
		Если ШтрихКодШтуки<> Неопределено Тогда 		
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ШтрихКоды.Владелец КАК Владелец
			|ПОМЕСТИТЬ НужныйВладелец
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.Наименование = &Наименование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ШтрихКоды.Наименование КАК ШтрихкодКоробки
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.Владелец В
			|			(ВЫБРАТЬ
			|				НужныйВладелец.Владелец КАК Владелец
			|			ИЗ
			|				НужныйВладелец КАК НужныйВладелец)
			|	И ШтрихКоды.ТипШК = &ТипШК
			|	И ШтрихКоды.ВидШК = &ВидШК";
			//Параметры запроса
			Запрос.УстановитьПараметр("Наименование",ШтрихКодШтуки);// Строка
			Запрос.УстановитьПараметр("ВидШК",       Перечисления.ВидыШК.Основной);// Виды ШК
			Запрос.УстановитьПараметр("ТипШК",       Перечисления.ТипыШтрихКодов.Коробка);// Типы штрих кодов
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				
				Возврат ЗначениеВХранилище(Результат.ШтрихкодКоробки);
				
			Иначе
				
				Возврат ЗначениеВХранилище(ШтрихКодШтуки);
				
			КонецЕсли;
				
		КонецЕсли;
	
	КОнецЕсли;  
	
	Возврат  ЗначениеВХранилище(Неопределено);
	
КонецФункции    


Функция ИнформацияПоЗНБ(Штрихкод)  Экспорт
		
	МойМассив = ЗначениеИзХранилища(Штрихкод);

    ШКЗНБ = МойМассив[0]; //получаем КОД в базе 64 
	
	//штатным спобом разбиваем и находим документ
	
	ЗНБ = ADRESS.ВернутьЗНБпоШтрихкоду(ШКЗНБ);
		
	Если ЗНБ<>Документы.ЗаданиеНабора.ПустаяСсылка() Тогда
		
		МассивСтр = Новый Массив;  
	    		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНабораТовары.Номенклатура.Код КАК НоменклатураКод,
		|	СУММА(ЗаданиеНабораТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|ГДЕ
		|	ЗаданиеНабораТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданиеНабораТовары.Номенклатура.Код";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ЗНБ);// ЗНБ
		ТЗЗНБ = Запрос.Выполнить().Выгрузить();   
		
		ДокСтруктра = Новый Структура;    
		ДокСтруктра.Вставить("ПредставлениеДок",Строка(ЗНБ));
		ДокСтруктра.Вставить("КодСектор",ЗНБ.Сектор.Код);
		ДокСтруктра.Вставить("ЭтоМаркировка",ЗНБ.ТребуетсяМаркировка);
		
		МассивСтр.Добавить(ДокСтруктра);
		МассивСтр.Добавить(ТЗЗНБ);	
					
		Возврат ЗначениеВХранилище(МассивСтр);
			                      		
	Иначе
		
		Возврат Неопределено
		
	КОнецЕсли; 
	
КонецФункции     

 
Функция ИнформацияПоВсемШтрихкодамНоменклатуры(КодСклада) 
		
	МассивСтр   = Новый Массив;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	               |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ОстаткиТовара
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад В (&Склады)) КАК ОстаткиТМЦОстатки
	               |ГДЕ
	               | ОстаткиТМЦОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ТипШК) КАК ТипШК,
	               |	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ВидШК) КАК ВидШК,
	               |	ШтрихКоды.Наименование КАК Штрихкод,
	               |	ШтрихКоды.Владелец.Код КАК Код,
	               |	ШтрихКоды.Владелец.Наименование КАК Наименование,
	               |	ШтрихКоды.Владелец.Родитель.Код КАК КодР,
	               |	ШтрихКоды.Владелец.Родитель.Наименование КАК НаименованиеР,
	               |	ШтрихКоды.Владелец.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	               |	ШтрихКоды.Владелец.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	               |	ШтрихКоды.Код КАК КодШК
	               |ИЗ
	               |	Справочник.ШтрихКоды КАК ШтрихКоды
	               |ГДЕ
	               |	НЕ ШтрихКоды.ПометкаУдаления
	               |	И ШтрихКоды.Владелец В
	               |			(ВЫБРАТЬ
	               |				ОстаткиТовара.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				ОстаткиТовара КАК ОстаткиТовара)";
	
	Склады = Новый СписокЗначений;
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STA-48")); // <Склады>[Склад Часцы (Основной)],
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STD-95")); // <Склады>[Маркировка Склад Часцы (Основной)]  
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-37")); // <Склады>[Маркировка Склад Часцы (Вычерки)]  
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-38")); // <Склады>[Склад Часцы (Вычерки)]
	
	Запрос.УстановитьПараметр("Склады", Склады);  
	Результат = Запрос.Выполнить().Выгрузить();
	МассивСтр.Добавить(Результат); 	
	
	Возврат ЗначениеВХранилище(МассивСтр);
		
КонецФункции      

Функция ИнформацияПоКодамНоменклатуры(ХрТЗКОДЫ) Экспорт	
	
	//Запрос через ВЕБ СЕРВИС InfoALLKod
	
	ТЗКОДЫ = ЗначениеИзХранилища(ХрТЗКОДЫ); 	        		
	//Входная таблица с кодами Номенклатуры     
	
	МассивСтр   = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗКОДЫ.Код КАК СТРОКА(10)) КАК КодТовара
	|ПОМЕСТИТЬ ТоварыКод
	|ИЗ
	|	&ТЗКОДЫ КАК ТЗКОДЫ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ОстаткиТовара
	|ИЗ
	|	ТоварыКод КАК ТоварыКод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ТоварыКод.КодТовара = Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ТипШК) КАК ТипШК,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ВидШК) КАК ВидШК,
	|	ШтрихКоды.Наименование КАК Штрихкод,
	|	ШтрихКоды.Владелец.Код КАК Код,
	|	ШтрихКоды.Владелец.Наименование КАК Наименование,
	|	ШтрихКоды.Владелец.Родитель.Код КАК КодР,
	|	ШтрихКоды.Владелец.Родитель.Наименование КАК НаименованиеР,
	|	ШтрихКоды.Владелец.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ШтрихКоды.Владелец.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	ШтрихКоды.Код КАК КодШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	НЕ ШтрихКоды.ПометкаУдаления
	|	И ШтрихКоды.Владелец В
	|			(ВЫБРАТЬ
	|				ОстаткиТовара.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ОстаткиТовара КАК ОстаткиТовара)";
	Запрос.УстановитьПараметр("ТЗКОДЫ", ТЗКОДЫ);  
	Результат = Запрос.Выполнить().Выгрузить();  
	
	
	ЗаписатьВЛог("АДРЕС",Строка(ТекущаяДата())+" "+Строка(Результат.Количество()),"Информация");

	МассивСтр.Добавить(Результат); 	
	
	Возврат ЗначениеВХранилище(МассивСтр);
	
КонецФункции  


Функция ИнформацияПоGTINНоменклатуры(врТЗКОДЫ) Экспорт	
	
	//Запрос через ВЕБ СЕРВИС InfoGTIN
	
	ТЗКОДЫ = ЗначениеИзХранилища(врТЗКОДЫ); 	        		
	//Входная таблица с кодами Номенклатуры     
	
	МассивСтр   = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ТЗКОДЫ.Код КАК СТРОКА(10)) КАК КодТовара
	               |ПОМЕСТИТЬ ТоварыКод
	               |ИЗ
	               |	&ТЗКОДЫ КАК ТЗКОДЫ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура,
	               |	Номенклатура.ГТИН КАК ГТИН
	               |ПОМЕСТИТЬ ТоварСсылки
	               |ИЗ
	               |	ТоварыКод КАК ТоварыКод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ТоварыКод.КодТовара = Номенклатура.Код
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИсторияГТИННоменклатуры.Номенклатура КАК Номенклатура,
	               |	ИсторияГТИННоменклатуры.ГТИН КАК ГТИН
	               |ПОМЕСТИТЬ ИзРЕГИСТРА
	               |ИЗ
	               |	РегистрСведений.ИсторияГТИННоменклатуры КАК ИсторияГТИННоменклатуры
	               |ГДЕ
	               |	ИсторияГТИННоменклатуры.Номенклатура В
	               |			(ВЫБРАТЬ
	               |				ТоварСсылки.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				ТоварСсылки КАК ТоварСсылки)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварСсылки.Номенклатура,
	               |	ТоварСсылки.ГТИН
	               |ИЗ
	               |	ТоварСсылки КАК ТоварСсылки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИзРЕГИСТРА.ГТИН КАК ГТИН,
	               |	ИзРЕГИСТРА.Номенклатура.Код КАК КодТовара
	               |ИЗ
	               |	ИзРЕГИСТРА КАК ИзРЕГИСТРА
	               |ГДЕ
	               |	ИзРЕГИСТРА.ГТИН <> """"";
	
	Запрос.УстановитьПараметр("ТЗКОДЫ", ТЗКОДЫ);  
	Результат = Запрос.Выполнить().Выгрузить();  
	
	МассивСтр.Добавить(Результат); 	
	
	Возврат ЗначениеВХранилище(МассивСтр);
	
КонецФункции 


Функция ИнформацияПоКодамНоменклатурыЛокально(ТЗКОДЫ) Экспорт	
				
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗКОДЫ.Код КАК СТРОКА(10)) КАК КодТовара
	|ПОМЕСТИТЬ ТоварыКод
	|ИЗ
	|	&ТЗКОДЫ КАК ТЗКОДЫ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ОстаткиТовара
	|ИЗ
	|	ТоварыКод КАК ТоварыКод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ТоварыКод.КодТовара = Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ТипШК) КАК ТипШК,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ВидШК) КАК ВидШК,
	|	ШтрихКоды.Наименование КАК Штрихкод,
	|	ШтрихКоды.Владелец.Код КАК Код,
	|	ШтрихКоды.Владелец.Наименование КАК Наименование,
	|	ШтрихКоды.Владелец.Родитель.Код КАК КодР,
	|	ШтрихКоды.Владелец.Родитель.Наименование КАК НаименованиеР,
	|	ШтрихКоды.Владелец.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ШтрихКоды.Владелец.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	ШтрихКоды.Код КАК КодШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	НЕ ШтрихКоды.ПометкаУдаления
	|	И ШтрихКоды.Владелец В
	|			(ВЫБРАТЬ
	|				ОстаткиТовара.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ОстаткиТовара КАК ОстаткиТовара)";
	Запрос.УстановитьПараметр("ТЗКОДЫ", ТЗКОДЫ);  
	Результат = Запрос.Выполнить().Выгрузить();  
	
	Возврат Результат;
	
КонецФункции 

Функция ОстаткиТовараНаСкладах(КодСклада) 
	
	//Остатки на складах ОСНОВНОЙ и МАРКИРОВКА
	
	МассивСтр   = Новый Массив;  
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК Остаток,
	|	ОстаткиТМЦОстатки.Номенклатура.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад В (&Склады)) КАК ОстаткиТМЦОстатки";
	
	Склады = Новый СписокЗначений;
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STA-48")); // <Склады>[Склад Часцы (Основной)], 
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-38")); // <Склады>[Склад Часцы (Вычерки)]

	Запрос.Параметры.Вставить("Склады", Склады); 	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
		
	МассивСтр.Добавить(РезультатЗапроса); 	
	
	//И маркировка
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК Остаток,
	|	ОстаткиТМЦОстатки.Номенклатура.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад В (&Склады)) КАК ОстаткиТМЦОстатки";
	
	Склады = Новый СписокЗначений;
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STD-95")); // <Склады>[Маркировка Склад Часцы (Основной)]	
	Склады.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-37")); // <Склады>[Маркировка Склад Часцы (Вычерки)] 
	
	Запрос.Параметры.Вставить("Склады", Склады); 	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивСтр.Добавить(РезультатЗапроса); 
	
	Возврат ЗначениеВХранилище(МассивСтр);
	
	
КонецФункции

Функция ОстаткиТовараВерхНиз(МассивТовара) Экспорт 
	
	//в массиве список товара и признак маркировки
	//возрващает остаток номенклатуры на ВЕРХУ и ВНИЗУ
	
	
	МойМассив = ЗначениеИзХранилища(МассивТовара); 
	
	СписокТовара  = МойМассив[0];
	ЭтоМаркировка = МойМассив[1];      	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК ОстатокВерх,
	|	0 КАК ОстатокНиз
	|ПОМЕСТИТЬ ОСТАТКИ
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			,
	|			Склад = &Склад
	|				И Номенклатура В (&СписокТовара)) КАК ОстаткиТМЦОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура,
	|	0,
	|	ОстаткиТМЦОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			,
	|			Склад = &СкладОсновной
	|				И Номенклатура В (&СписокТовара)) КАК ОстаткиТМЦОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОСТАТКИ.Номенклатура КАК Номенклатура,
	|	СУММА(ОСТАТКИ.ОстатокВерх) КАК ОстатокВерх,
	|	СУММА(ОСТАТКИ.ОстатокНиз) КАК ОстатокНиз
	|ИЗ
	|	ОСТАТКИ КАК ОСТАТКИ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОСТАТКИ.Номенклатура";         
	
	
	Если ЭтоМаркировка Тогда
		
		Запрос.УстановитьПараметр("Склад",         Справочники.Склады.НайтиПоКоду("STЕ-17"));// Маркировка Склад Часцы (Паллетного хранения)
		Запрос.УстановитьПараметр("СкладОсновной", Справочники.Склады.НайтиПоКоду("STD-95"));// Маркировка Склад Часцы (Основной)
		
	Иначе
		Запрос.УстановитьПараметр("Склад",         Справочники.Склады.НайтиПоКоду("STC-27"));// Склад Часцы (Паллетного хранения)
		Запрос.УстановитьПараметр("СкладОсновной", Справочники.Склады.НайтиПоКоду("STA-48"));// Склад Часцы (Основной)
		
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("СписокТовара",СписокТовара);// Список значений
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	Возврат ЗначениеВХранилище(РезультатЗапроса);
	
КонецФункции

Функция ДанныеПоДокументу(ГУИДДОК) Экспорт    
	
	ЗаписатьВЛог("АДРЕС","Начало выполнения-Данные по документу","Информация");
	
	//получаем массив
	МойМассив = ЗначениеИзХранилища(ГУИДДОК); 	
	//получаем ГУИД из массива по нулевому индексу
	ГУИД          = МойМассив[0];    
	ВариантОтвета = МойМассив[1]; 
	//ищем документ в базе по ГУИД
	СсылкаДок=ADRESS.ВернутьДокументПоГУИД(ГУИД); 

	Ответ="";
	
	Если СсылкаДок<>Неопределено Тогда   
		
		Если ТипЗнч(СсылкаДок) = Тип("ДокументСсылка.ЛистНабора") Тогда	
			
			МассивДОк = Новый Массив;  
			
			ДокументОснование= СсылкаДок.ДокОснование;
			
			СтрДокОснования = Новый Структура;
			СтрДокОснования.Вставить("СтрОснование", Строка(ДокументОснование));
		    СтрДокОснования.Вставить("ГУИДОснование",Строка(ДокументОснование.УникальныйИдентификатор())); 	
			СтрДокОснования.Вставить("ГУИД",         Строка(СсылкаДок.УникальныйИдентификатор())); 
			СтрДокОснования.Вставить("Основание",    Строка(СсылкаДок));
			
			МассивДОк.Добавить(СтрДокОснования);
			//ТЮА 23.12.2025
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛистНабораТовары.Номенклатура.Код КАК Код,
			               |	ЛистНабораТовары.Количество КАК Количество,
			               |	ПРЕДСТАВЛЕНИЕ(ЛистНабораТовары.ТипШК) КАК ТипШК,
			               |	ЛистНабораТовары.ШК КАК Штрихкод,
			               |	ЛистНабораТовары.ШтВКоробе КАК КолвоСкан,
			               |	ЛистНабораТовары.ЭтоНекондиция КАК ЭтоНекондиция,
			               |	ЛистНабораТовары.ЭтоБрак КАК ЭтоБрак,
			               |	ЛистНабораТовары.Ссылка.КоличествоДокумента КАК КоличествоДокумента,
			               |	ЛистНабораТовары.Ссылка.КоличествоКоробок КАК КоличествоКоробок,
			               |	ЛистНабораТовары.Ссылка.НеполныйКороб КАК НеполныйКороб
			               |ИЗ
			               |	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
			               |ГДЕ
			               |	ЛистНабораТовары.Ссылка = &Ссылка";
			//Параметры запроса
			Запрос.УстановитьПараметр("Ссылка",СсылкаДок);// ЛН
			
			Результат = Запрос.Выполнить().Выгрузить(); 
			
			Если Результат.Количество()>0 Тогда    
												
				Результат.Колонки.Добавить("ИнфоОТоваре");
				
				Для Каждого стр из Результат Цикл
					Стр.ИнфоОтоваре = ADRESS.МассивОНоменклатура(стр.Штрихкод);
				КонецЦикла;
				
				МассивДОк.Добавить(Результат);				
				Возврат ЗначениеВХранилище(МассивДОк); 
				
			Иначе
				Ответ= "Документ пустой"; 			
			КонецЕсли;  		
			
		Иначе
			Ответ= "Этот документ не ЛИСТ НАБОРА.Отмена";	
		КонецЕсли;		
	Иначе     
		
		Ответ= "Не найден документ";
		
	КонецЕсли;   
	
	Возврат ЗначениеВХранилище(Ответ);
	
КонецФункции

//////////////////////////////////////обмен документами////////////////////////////////////////////////////

Функция ВыгрузкаНужныхДокументов(ГУИДДОК) Экспорт    
	
	
	
	//получаем массив
	МойМассив     = ЗначениеИзХранилища(ГУИДДОК); 	
	//получаем ГУИД из массива по нулевому индексу
	ТЗГУИД        = МойМассив[0];     //ГУИД документов
	ВидДок        = МойМассив[1];     //вид документа
	НачВремя      = МойМассив[2];     //начало переиода
	КонВремя      = МойМассив[3];     //конецПериода
	СтатусДок     = МойМассив[4];     //статус документа

	Если ВидДок = "РасходнаяНакладная" Тогда  
		
	    ЗаписатьВЛог("АДРЕС","НАЧАЛО ОБМЕНА РНК "+Строка(ТекущаяДата()),"Информация");	
		//если ТЗ ГУИД пустая - значит нужно получить все НОВЫЙ ДОКУМЕНТЫ (ГУИДЫ) для проверки
		Если ТЗГУИД.Количество()=0 Тогда
			
			//СостояниеНакладной  =    ПолучитьСсылкуНаЗначениеПеречисления("СостоянияНакладной",СтатусДок);			
			//ЗаписатьВЛог("АДРЕС",Строка(СостояниеНакладной),"Информация");
			//ТЮА на будущее передавать состояния накладных - для регулировки потока  
			
			
			//получим все ОТГРУЖЕННЫЕ ДОКУМЕНТЫ
			Если СтатусДок="Отгружено" Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	РасходнаяНакладная.Ссылка КАК Док
				|ПОМЕСТИТЬ НужныеДок
				|ИЗ
				|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
				|ГДЕ
				|	РасходнаяНакладная.Проведен
				|	И РасходнаяНакладная.ДатаОтгрузки МЕЖДУ &НачВремя И &КонВремя
				|	И РасходнаяНакладная.СостояниеНакладной =&СостояниеНакладной
				|	И РасходнаяНакладная.Склад В ИЕРАРХИИ(&Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НужныеДок.Док)) КАК ГУИД
				|ИЗ
				|	НужныеДок КАК НужныеДок     
				|	
				|";
				//Параметры запроса
				
				Запрос.УстановитьПараметр("НачВремя",НачВремя);// Дата
				Запрос.УстановитьПараметр("КонВремя",КонВремя);// Дата
				Запрос.УстановитьПараметр("Склад",   Справочники.Склады.НайтиПоКоду("STA-47"));// Склад Часцы
												
				Запрос.УстановитьПараметр("СостояниеНакладной",Перечисления.СостоянияНакладной.Отгружена);// Список значений				
				Результат = Запрос.Выполнить().Выгрузить(); 		
				
				Возврат ЗначениеВХранилище(Результат);  

			Иначе      
				//иначе все готовящиеся к отгрузке
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	РасходнаяНакладная.Ссылка КАК Док
				|ПОМЕСТИТЬ НужныеДок
				|ИЗ
				|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
				|ГДЕ
				|	РасходнаяНакладная.Проведен
				|	И РасходнаяНакладная.ДатаОтгрузки МЕЖДУ &НачВремя И &КонВремя
				|	И НЕ РасходнаяНакладная.СостояниеНакладной В (&СостояниеНакладной)
				|	И РасходнаяНакладная.Склад В ИЕРАРХИИ(&Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НужныеДок.Док)) КАК ГУИД
				|ИЗ
				|	НужныеДок КАК НужныеДок     
				|	
				|";
				//Параметры запроса
				
				Запрос.УстановитьПараметр("НачВремя",НачВремя);// Дата
				Запрос.УстановитьПараметр("КонВремя",КонВремя);// Дата
				Запрос.УстановитьПараметр("Склад",   Справочники.Склады.НайтиПоКоду("STA-47"));// Склад Часцы
				
				//Параметр список 'СостояниеНакладной'
				ПараметрСписок_СостояниеНакладной = Новый СписокЗначений;
				ПараметрСписок_СостояниеНакладной.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				ПараметрСписок_СостояниеНакладной.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
				ПараметрСписок_СостояниеНакладной.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
				ПараметрСписок_СостояниеНакладной.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования); 
				
				Запрос.УстановитьПараметр("СостояниеНакладной",ПараметрСписок_СостояниеНакладной);// Список значений
				
				Результат = Запрос.Выполнить().Выгрузить(); 		
				
				Возврат ЗначениеВХранилище(Результат);  
				
			КонецЕсли;
			
		Иначе
			
			//есть НЕОБРАБОТАННЫЕ документы
			
			НоваяТЗ = Новый ТаблицаЗначений;
			НоваяТЗ.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная"));
			НоваяТЗ.Колонки.Добавить("ГУИД",     Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
			НоваяТЗ.Колонки.Добавить("ДанныеДОк",Новый ОписаниеТипов("ТаблицаЗначений"));
			НоваяТЗ.Колонки.Добавить("Номер");
			НоваяТЗ.Колонки.Добавить("Дата");
			НоваяТЗ.Колонки.Добавить("ДатаОтгрузки");
			НоваяТЗ.Колонки.Добавить("ТребуетсяМаркировка");
			
			
			Для Каждого Гдок из ТЗГУИД Цикл 
				
				ТекДок = Документы.РасходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор(Гдок.ГУИД));
				
				Если Найти(Строка(ТекДок),"Объект не найден")=0 Тогда 				
					СтрТЗ                     = НоваяТЗ.Добавить();
					СтрТЗ.Документ            = ТекДок; 
					СтрТЗ.ГУИД                = Гдок.ГУИД;
					СтрТЗ.Номер               = ТекДок.Номер;
					СтрТЗ.Дата                = ТекДок.Дата;
					СтрТЗ.ДатаОтгрузки        = ТекДок.ДатаОтгрузки;
					СтрТЗ.ТребуетсяМаркировка = ТекДок.ТребуетсяМаркировка;

				Иначе
					ЗаписатьВЛог("АДРЕС","Не найден документ по ГУИД "+Строка(Гдок.ГУИД),"Ошибка");
				КонецЕсли;
				
			КОнецЦикла;				   
			
			//получить ВСЮ НОМЕНКЛУТУРУ (по НОВЫМ документам) для проверки ее наличия в АДРЕСЕ
			ТЗКодовТовара= ПолучитьКодыНоменклатурыПоДокументам(НоваяТЗ);	
			
			НовМас       = Новый Массив;			
			//инфомация о новом товаре  таблица с КОДАМИ НОВОГО ТОВАРА 
			
			Если ТЗКодовТовара=Неопределено Тогда
				ТЗКодовТовара=Новый ТаблицаЗначений;
			КонецЕсли;
			
			НовМас.Добавить(ТЗКодовТовара);	
			
			//получим полную информацию о НОВЫХ документах
			
			Для Каждого СтрДок из НоваяТЗ Цикл				
				СтрДок.ДанныеДОк =  ВернутьДанныеПоРасходнойНакладной(СтрДок.Документ);		
			КОнецЦикла;	     
			
			//НоваяТЗ.ЗаполнитьЗначения("","Документ");
			НоваяТЗ.Колонки.Удалить("Документ");
			//инфомация о докумнетах
			НовМас.Добавить(НоваяТЗ);
			
			ЗаписатьВЛог("АДРЕС","КОНЕЦ ОБМЕНА РНК "+Строка(ТекущаяДата()),"Информация"); 
			
			Возврат ЗначениеВХранилище(НовМас);  		
			
		КонецЕсли;     
		
	ИначеЕсли ВидДок = "ПриходнаяНакладная" Тогда
	     ЗаписатьВЛог("АДРЕС","НАЧАЛО ОБМЕНА ПНК "+Строка(ТекущаяДата()),"Информация");	
		
		Если ТЗГУИД.Количество()=0 Тогда  		
						
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОстаткиТМЦОстаткиИОбороты.Регистратор КАК Док
			|ПОМЕСТИТЬ ВсеДок
			|ИЗ
			|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Начвремя, &Конвремя, Регистратор, , Склад В (&Склады)) КАК ОстаткиТМЦОстаткиИОбороты
			|ГДЕ
			|	ОстаткиТМЦОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиТМЦОстаткиИОбороты.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВсеДок.Док)) КАК ГУИД
			|ИЗ
			|	ВсеДок КАК ВсеДок";  
			
			//Параметры запроса
			Запрос.УстановитьПараметр("НачВремя",      НачВремя);// Дата 
			Запрос.УстановитьПараметр("КонВремя",      КонВремя);// Дата
			
			//Параметр список 'Склад'
			Склады = Новый СписокЗначений;
			Склады.Добавить(Справочники.Склады.НайтиПоКоду("STA-48")); // <Склады>[Склад Часцы (Основной)],
			Склады.Добавить(Справочники.Склады.НайтиПоКоду("STD-95")); // <Склады>[Маркировка Склад Часцы (Основной)]  
			Склады.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-37")); // <Склады>[Маркировка Склад Часцы (Вычерки)]  
			Склады.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-38")); // <Склады>[Склад Часцы (Вычерки)]
			
			Запрос.УстановитьПараметр("Склады",Склады );// Список значений
            							
			Результат = Запрос.Выполнить().Выгрузить();  			      
			
			Возврат ЗначениеВХранилище(Результат);       
			
		Иначе
			
			//есть НЕОБРАБОТАННЫЕ документы 
			
			НоваяТЗ = Новый ТаблицаЗначений;
			НоваяТЗ.Колонки.Добавить("Документ",  Новый ОписаниеТипов("ДокументСсылка.ПриходнаяНакладная"));
			НоваяТЗ.Колонки.Добавить("ГУИД",      Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
			НоваяТЗ.Колонки.Добавить("ДанныеДОк", Новый ОписаниеТипов("ТаблицаЗначений"));
			НоваяТЗ.Колонки.Добавить("ЛистыНабора",Новый ОписаниеТипов("ТаблицаЗначений"));			
			НоваяТЗ.Колонки.Добавить("Номер");
			НоваяТЗ.Колонки.Добавить("Дата");
			НоваяТЗ.Колонки.Добавить("ДатаОтгрузки");
			НоваяТЗ.Колонки.Добавить("ТребуетсяМаркировка");
			
			
			Для Каждого Гдок из ТЗГУИД Цикл 
				
				ТекДок = Документы.ПриходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор(Гдок.ГУИД));
				
				Если Найти(Строка(ТекДок),"Объект не найден")=0 Тогда 				
					СтрТЗ                     = НоваяТЗ.Добавить();
					СтрТЗ.Документ            = ТекДок; 
					СтрТЗ.ГУИД                = Гдок.ГУИД;
					СтрТЗ.Номер               = ТекДок.Номер;
					СтрТЗ.Дата                = ТекДок.Дата;
					СтрТЗ.ДатаОтгрузки        = ТекДок.ДатаОтгрузки;
					СтрТЗ.ТребуетсяМаркировка = ТекДок.ТребуетсяМаркировка;

				Иначе
					ЗаписатьВЛог("АДРЕС","Не найден документ по ГУИД "+Строка(Гдок.ГУИД),"Ошибка");
				КонецЕсли;
				
			КОнецЦикла;				   
			
			//получить ВСЮ НОМЕНКЛУТУРУ (по НОВЫМ документам) для проверки ее наличия в АДРЕСЕ
			ТЗКодовТовара= ПолучитьКодыНоменклатурыПоПНК(НоваяТЗ);	
			
			НовМас       = Новый Массив;			
			//инфомация о новом товаре  таблица с КОДАМИ НОВОГО ТОВАРА 
			
			Если ТЗКодовТовара=Неопределено Тогда
				ТЗКодовТовара=Новый ТаблицаЗначений;
			КонецЕсли;
			
			НовМас.Добавить(ТЗКодовТовара);	
			
			//получим полную информацию о НОВЫХ документах
			
			Для Каждого СтрДок из НоваяТЗ Цикл				
				СтрДок.ДанныеДОк   =  ВернутьДанныеПоПриходнойНакладной(СтрДок.Документ);	
				СтрДок.ЛистыНабора =  ПолучитьЛНпоПриходнойНакладной(СтрДок.Документ);
			КОнецЦикла;	     
			
			//НоваяТЗ.ЗаполнитьЗначения("","Документ");
			НоваяТЗ.Колонки.Удалить("Документ");
			//инфомация о докумнетах
			НовМас.Добавить(НоваяТЗ);   // это документ ОФФ:Приходная накладная !!!
						
			ЗаписатьВЛог("АДРЕС","КОНЕЦ ОБМЕНА ПНК "+Строка(ТекущаяДата()),"Информация"); 
			
			Возврат ЗначениеВХранилище(НовМас);     		
			
		КонецЕсли;	                                
		
		
	КонецЕсли;                      	
	
КонецФункции      

Функция ПолучитьЛНпоПриходнойНакладной(Док)
	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(ЛистНабораТовары.Ссылка) КАК Описание,
	               |	ЛистНабораТовары.Ссылка.Номер КАК Номер,
	               |	ЛистНабораТовары.Ссылка.Дата КАК Дата,
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЛистНабораТовары.Ссылка) КАК ГУИД,
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЛистНабораТовары.Ссылка.ДокОснование) КАК ГУИДОснование,
	               |	ПРЕДСТАВЛЕНИЕ(ЛистНабораТовары.Ссылка.ДокОснование) КАК ОписаниеДокОснования,
	               |	ЛистНабораТовары.Номенклатура.Код КАК Код,
	               |	ЛистНабораТовары.Количество КАК Количество,
	               |	ПРЕДСТАВЛЕНИЕ(ЛистНабораТовары.ТипШК) КАК ТипШК,
	               |	ЛистНабораТовары.ШК КАК ШК,
	               |	ЛистНабораТовары.ШтВКоробе КАК ШтВКоробе,
	               |	ЛистНабораТовары.ЭтоНекондиция КАК ЭтоНекондиция,
	               |	ЛистНабораТовары.ЭтоБрак КАК ЭтоБрак
	               |ИЗ
	               |	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	               |ГДЕ
	               |	ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
	               |	И ЛистНабораТовары.Ссылка.Проведен
	               |	И ЛистНабораТовары.Количество > 0";
	//Параметры запроса
	Запрос.УстановитьПараметр("ДокОснование",Док);// ПНК
	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции 

Функция ВернутьДанныеПоРасходнойНакладной(Док) 
	
	Если Док.ОтгрузкаКомплектов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура.Код КАК Код,
		|	РасходнаяНакладнаяКомплектующие.Количество КАК Количество,
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходнаяНакладнаяКомплектующие.Номенклатура)) КАК GUID
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Количество > 0
		|	И РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Док);// ссылка на документ  
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура.Код КАК Код,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество,
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РасходнаяНакладнаяТовары.Номенклатура)) КАК GUID
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Количество > 0
		|	И РасходнаяНакладнаяТовары.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Док);// ссылка на документ  
		
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса; 
	
КонецФункции    

Функция ВернутьДанныеПоПриходнойНакладной(Док)
	  		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяТовары.Номенклатура.Код КАК Код,
		|	ПриходнаяНакладнаяТовары.Количество КАК Количество
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
		|ГДЕ
		|	ПриходнаяНакладнаяТовары.Количество > 0
		|	И ПриходнаяНакладнаяТовары.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", Док);// ссылка на документ
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса; 
	
КонецФункции

Функция ПолучитьКодыНоменклатурыПоДокументам(НужныеДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗДОК.Документ КАК Ссылка
	               |ПОМЕСТИТЬ НужныеДок
	               |ИЗ
	               |	&НужныеДок КАК ТЗДОК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ИтогТовар
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура
	               |	ИЗ
	               |		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |	ГДЕ
	               |		РасходнаяНакладнаяТовары.Ссылка В
	               |				(ВЫБРАТЬ
	               |					НужныеДок.Ссылка КАК Ссылка
	               |				ИЗ
	               |					НужныеДок КАК НужныеДок)
	               |		И РасходнаяНакладнаяТовары.Количество > 0
	               |		И НЕ РасходнаяНакладнаяТовары.Ссылка.ОтгрузкаКомплектов
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РасходнаяНакладнаяТовары.Номенклатура
	               |	ИЗ
	               |		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |	ГДЕ
	               |		РасходнаяНакладнаяТовары.Ссылка В
	               |				(ВЫБРАТЬ
	               |					НужныеДок.Ссылка КАК Ссылка
	               |				ИЗ
	               |					НужныеДок КАК НужныеДок)
	               |		И РасходнаяНакладнаяТовары.Количество > 0
	               |		И РасходнаяНакладнаяТовары.Ссылка.ОтгрузкаКомплектов) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИтогТовар.Номенклатура)) КАК GUID,
	               |	ИтогТовар.Номенклатура.Код КАК Код
	               |ИЗ
	               |	ИтогТовар КАК ИтогТовар";
	//Параметры запроса

	Запрос.УстановитьПараметр("НужныеДок", НужныеДок);// Дата

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции         


Функция ПолучитьКодыНоменклатурыПоПНК(НужныеДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗДОК.Документ КАК Ссылка
	|ПОМЕСТИТЬ НужныеДок
	|ИЗ
	|	&НужныеДок КАК ТЗДОК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ИтогТовар
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				НужныеДок.Ссылка КАК Ссылка
	|			ИЗ
	|				НужныеДок КАК НужныеДок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИтогТовар.Номенклатура)) КАК GUID,
	|	ИтогТовар.Номенклатура.Код КАК Код
	|ИЗ
	|	ИтогТовар КАК ИтогТовар";
	//Параметры запроса

	Запрос.УстановитьПараметр("НужныеДок", НужныеДок);// Дата

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции 


 /////////////////////////////////////обмен документами////////////////////////////////////////////////////

// Возвращает ПеречисленияСсылка по "Имени" перечисления и "Имени" значения
// Пример пИмяПеречисления = "ЮрФизЛицо", пИмяЗначения = "ЮрЛицо",
// результат: Перечисление ссылка на ЮрФизЛицо.ЮрЛицо
// пИмяПеречисления - тип строка
// пИмяЗначения - тип строка
Функция ПолучитьСсылкуНаЗначениеПеречисления(пИмяПеречисления,пИмяЗначения ) Экспорт
    Попытка
        Возврат Перечисления[пИмяПеречисления][пИмяЗначения];
    исключение
        Сообщить("Ошибка получения ссылки на значение перечисления. " + пИмяПеречисления + " :: " + пИмяЗначения);
        Возврат неопределено;
    КонецПопытки;
КонецФункции   


///////////////////////////вспомогательные функции///////////////////
